fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.BKM_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Ответсвенный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачислния</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ВКМ_График</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_График</schedule>
  <scheduleValue>InformationRegister.ВКМ_График.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_График.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_График</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/BKM_Удержания/BKM_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>BKM_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ВсегоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_График</types>
    </type>
  </resources>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорияСотрудника</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			
#Область ОбработчикиСобытий
			
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответсвенный = Пользователи.АвторизованныйПользователь(); 
КонецПроцедуры
			
Процедура ОбработкаПроведения(Отказ, Режим)   
				
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;  
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.BKM_Удержания.Записывать = Истина;   
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.ВКМ_ОсновныеНачисления");  
	ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.ВКМ_ДополнительныеНачисления");  
    ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.BKM_Удержания"); 
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы"); 
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ОсновныеНачислния;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник"); 
	Блокировка.Заблокировать();
	
	Если Не ЭтоНовый() Тогда  
		СформироватьСторноЗаписи(ЭтотОбъект.Ссылка);
	КонецЕсли;    
	
	СотрудникиДокумента = Новый Массив;
    Для Каждого Строка Из ЭтотОбъект.ОсновныеНачислния Цикл
        СотрудникиДокумента.Добавить(Строка.Сотрудник);
    КонецЦикла;
    
    ОкладыСотрудников = ПолучитьОкладыСотрудников(СотрудникиДокумента, Дата);
	
	Для Каждого ТекСтрокаОсновныеНачислния Из ОсновныеНачислния Цикл
		
		ОкладСотрудника = 0; 
		Сотрудник =  ТекСтрокаОсновныеНачислния.Сотрудник;
		ОкладДанные = ОкладыСотрудников.Получить(Сотрудник);
		
		Если ОкладДанные <> Неопределено Тогда
			ОкладСотрудника = ОкладДанные.Оклад;
		КонецЕсли;	
		
		БазовыйПериодНачало = ДАТА(1, 1, 1);
		БазовыйПериодКонец = ДАТА(1, 1, 1);
		ОтработаноДней = 0;
		СуммаРасчета = 0;
		
		Если ТекСтрокаОсновныеНачислния.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			
			БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаОсновныеНачислния.ДатаНачала, -12));
			БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаОсновныеНачислния.ДатаНачала, -1));
			
			ОтработаноДней = РассчитатьОтработанныеДни(БазовыйПериодНачало,БазовыйПериодКонец,ТекСтрокаОсновныеНачислния.Сотрудник);
			СуммаЗаПериод = ПолучитьСуммуНачисленийЗаПериод( ТекСтрокаОсновныеНачислния.Сотрудник,БазовыйПериодНачало,БазовыйПериодКонец);
			
			Если ОтработаноДней > 0 Тогда
				СредняяЗарплата = СуммаЗаПериод / ОтработаноДней;
			Иначе
				СредняяЗарплата = 0;
			КонецЕсли;
			
			ДниОтпуска = РассчитатьОтработанныеДни(ТекСтрокаОсновныеНачислния.ДатаНачала, ТекСтрокаОсновныеНачислния.ДатаОкончания, ТекСтрокаОсновныеНачислния.Сотрудник);
			
			СуммаРасчета = СредняяЗарплата * ДниОтпуска;
			ОтработаноДней = 0;
			
		Иначе
			ОтработаноДней = РассчитатьОтработанныеДни( БазовыйПериодНачало, БазовыйПериодКонец, ТекСтрокаОсновныеНачислния.Сотрудник);
			СуммаРасчета = ОкладСотрудника;
			
		КонецЕсли;
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачислния.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачислния.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачислния.ДатаОкончания;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаОсновныеНачислния.Сотрудник; 
		Движение.Результат = СуммаРасчета;   
		Движение.Показатель = СуммаРасчета;
		Движение.ОтработаноДней = ОтработаноДней;
		Движение.График = ТекСтрокаОсновныеНачислния.График;  
		
		Движение = Движения.BKM_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = ТекСтрокаОсновныеНачислния.ДатаНачала;
		Движение.Сотрудник = ТекСтрокаОсновныеНачислния.Сотрудник; 
		СуммаНДФЛ = СуммаРасчета * 13 /100;
		Движение.Результат = СуммаНДФЛ ;
		
		СуммаВзаиморасчета =  СуммаРасчета - СуммаНДФЛ; 
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = СуммаВзаиморасчета;
	КонецЦикла;  
	
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл     
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаДополнительныеНачисления.Сумма;
		Движение.ЧасовКОплате = ТекСтрокаДополнительныеНачисления.ВсегоЧасов;

		Движение = Движения.BKM_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник; 
		СуммаНДФЛ = ТекСтрокаДополнительныеНачисления.Сумма * 13 /100;
		Движение.Результат = СуммаНДФЛ;  
		
		СуммаВзаиморасчетаДоп = ТекСтрокаДополнительныеНачисления.Сумма - СуммаНДФЛ; 
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = СуммаВзаиморасчетаДоп;
	КонецЦикла;


КонецПроцедуры     

Функция ПолучитьОкладыСотрудников(Сотрудники, НаДату)
    
    Результат = Новый Соответствие;
		
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
    |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
    |ИЗ
    |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
    |ГДЕ
    |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник В(&Сотрудники)";
    
    Запрос.УстановитьПараметр("Дата", КонецМесяца(НаДату));
    Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Вставить(Выборка.Сотрудник, Новый Структура("Оклад", Выборка.Оклад));
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

Процедура СформироватьСторноЗаписи(Ссылка)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
    |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
    |	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
    |	ВКМ_ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
    |	ВКМ_ОсновныеНачисления.Результат КАК Результат,
    |	ВКМ_ОсновныеНачисления.ОтработаноДней КАК ОтработаноДней,
    |	ВКМ_ОсновныеНачисления.График КАК График
    |ИЗ
    |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
    |ГДЕ
    |	НЕ ВКМ_ОсновныеНачисления.Сторно
    |	И ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Результат = Запрос.Выполнить();
    ВыборкаДанных = Результат.Выбрать();  
	
	Пока ВыборкаДанных.Следующий() Цикл
		ДвижениеСторно = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ВыборкаДанных);
		ДвижениеСторно.ПериодРегистрации = Дата;
		ДвижениеСторно.Сторно = Истина;
	КонецЦикла;


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Результат КАК Результат,
	|	ВКМ_ДополнительныеНачисления.ЧасовКОплате КАК ЧасовКОплате,
	|	ВКМ_ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	НЕ ВКМ_ДополнительныеНачисления.Сторно
	|	И ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	ВыборкаДополнительные = Результат.Выбрать();  
	
	Пока ВыборкаДополнительные.Следующий() Цикл
		ДвижениеСторно = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ВыборкаДополнительные);
		ДвижениеСторно.ПериодРегистрации = Дата;
		ДвижениеСторно.Сторно = Истина;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_Удержания.ВидРасчета КАК ВидРасчета,
	|	BKM_Удержания.Сотрудник КАК Сотрудник,
	|	BKM_Удержания.Результат КАК Результат
	|ИЗ
	|	РегистрРасчета.BKM_Удержания КАК BKM_Удержания
	|ГДЕ
	|	НЕ BKM_Удержания.Сторно
	|	И BKM_Удержания.Регистратор.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	ВыборкаУдержания = Результат.Выбрать();  
	
	Пока ВыборкаУдержания.Следующий() Цикл
		ДвижениеСторно = Движения.BKM_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ВыборкаУдержания);
		ДвижениеСторно.ПериодРегистрации = Дата;
		ДвижениеСторно.Сторно = Истина;
	КонецЦикла;  
	
КонецПроцедуры	

Функция РассчитатьОтработанныеДни(ДатаНачала, ДатаОкончания, Сотрудник)
	
	ОтработаноДней = 0;
	ТекущаяДата = ДатаНачала;
	
	Пока ТекущаяДата <= ДатаОкончания Цикл
		ДеньНедели = ДеньНедели(ТекущаяДата);
		
		Если ДеньНедели >= 1 И ДеньНедели <= 5 Тогда
			Если НЕ ЭтоПраздник(ТекущаяДата) Тогда
				ОтработаноДней = ОтработаноДней + 1;
			КонецЕсли;
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 86400; 
	КонецЦикла;
	
	Возврат ОтработаноДней;
				
КонецФункции
			
Функция ЭтоПраздник(Дата)
	
	ПраздничныеДни = ПолучитьПраздничныеДни(Год(Дата));
	
	Для Каждого ПраздникДата Из ПраздничныеДни Цикл
		Если ПраздникДата = Дата Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
			
Функция ПолучитьПраздничныеДни(Год)
	
	ПраздникиМассив = Новый Массив;
	
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 1));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 2));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 3));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 4));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 5));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 6));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 7));
	ПраздникиМассив.Добавить(ДАТА(Год, 1, 8));
	
	ПраздникиМассив.Добавить(ДАТА(Год, 2, 23));  // День защитника Отечества
	ПраздникиМассив.Добавить(ДАТА(Год, 3, 8));   // Международный женский день
	ПраздникиМассив.Добавить(ДАТА(Год, 5, 1));   // День труда
	ПраздникиМассив.Добавить(ДАТА(Год, 5, 9));   // День Победы
	ПраздникиМассив.Добавить(ДАТА(Год, 6, 12));  // День России
	ПраздникиМассив.Добавить(ДАТА(Год, 11, 4));  // День согласия и примирения
	
	Возврат ПраздникиМассив;
	
КонецФункции

Функция ПолучитьСуммуНачисленийЗаПериод(Сотрудник, ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК СуммаНачислений
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Сотрудник = &Сотрудник
	|	И ВКМ_ОсновныеНачисления.ПериодДействияНачало >= &ДатаНачала
	|	И ВКМ_ОсновныеНачисления.ПериодДействияКонец <= &ДатаОкончания
	|	И НЕ ВКМ_ОсновныеНачисления.Сторно";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой()Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			Возврат Выборка.СуммаНачислений;
		КонецЦикла;   
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
			
Функция РассчитатьРабочиеДни(ДатаНачала, ДатаОкончания)
	
	ОтработаноДней = 0;
	ТекущаяДата = ДатаНачала;
	
	Пока ТекущаяДата <= ДатаОкончания Цикл
		ДеньНедели = ДеньНедели(ТекущаяДата);
		Если ДеньНедели >= 1 И ДеньНедели <= 5 Тогда 
			ОтработаноДней = ОтработаноДней + 1;
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
	
	Возврат ОтработаноДней;
	
КонецФункции
 	
#КонецОбласти
	
#КонецЕсли
